Repository: harshil-kmphitech/flutter_new_structure
Catalog: lib/l10n/app_*.arb
Languages: hi

# title
source: Hello
hi: हैलो वर्ल्ड

# description
source: Hello World in description
hi: विवरण में हैलो वर्ल्ड

# emailLabel
source: Email
hi: ईमेल

# passwordLabel
source: Password
hi: पासवर्ड

# confirmPasswordLabel
source: Confirm Password
hi: पासवर्ड की पुष्टि कीजिये

# nameLabel
source: Name
hi: नाम

# phoneNumberLabel
source: Phone Number
hi: फ़ोन नंबर

# newPasswordLabel
source: New Password
hi: नया पासवर्ड

# codeLabel
source: Verification Code
hi: सत्यापन कोड

source: Login
hi: लॉग इन करें

source: Register
hi: पंजीकरण करवाना

# sendResetLinkButton
source: Send Reset Link
hi: रीसेट लिंक भेजें

source: Verify Code
hi: कोड सत्यापित करें

source: Reset Password
hi: पासवर्ड रीसेट

source: Forgot Password
hi: पासवर्ड भूल गए

# registerRedirect
source: Don't have an account? Register now
hi: कोई खाता नहीं है? पंजीकरण करवाना

# forgotPasswordRedirect
source: Forgot your password?
hi: अपना कूट शब्द भूल गए?

# loginSuccess
source: Login successful
hi: लॉग इन सफल

# loginFailed
source: Login failed. Please try again
hi: लॉगिन विफल। कृपया पुन: प्रयास करें

# registerSuccess
source: Registration successful
hi: सफल पंजीकरण

# registerFailed
source: Registration failed. Please try again
hi: पंजीकरण विफल रहा। कृपया पुन: प्रयास करें

source: Password reset email sent
hi: पासवर्ड रीसेट ईमेल भेजा गया

# passwordResetFailed
source: Failed to send reset email
hi: रीसेट ईमेल भेजने में विफल

# passwordResetSuccess
source: Password reset successful
hi: पासवर्ड रीसेट सफल

# passwordMismatch
source: Passwords do not match
hi: सांकेतिक शब्द मेल नहीं खाते

# codeVerificationSuccess
source: Code verification successful
hi: कोड सत्यापन सफल

source: Code verification failed
hi: कोड सत्यापन विफल रहा

# emptyEmail
source: Please enter a email address
hi: कृपया एक ईमेल पता दर्ज करें

# invalidEmail
source: Please enter a valid email address
hi: कृपया एक मान्य ईमेल पता प्रविष्ट करें

# emptyPassword
source: Please enter password
hi: कृपया पासवर्ड दर्ज करें

# emptyName
source: Name should not be empty
hi: नाम खाली नहीं होना चाहिए

# emptyPhoneNumber
source: Please enter phone number
hi: कृपया फ़ोन नंबर दर्ज करें

# emptyConfirmPassword
source: Please enter confirm password
hi: कृपया पुष्टि पासवर्ड दर्ज करें

# emptyVerificationCode
source: Please enter verification code
hi: कृपया सत्यापन कोड दर्ज करें

# apiError
source: An error occurred. Please try again later
hi: एक त्रुटि पाई गई। कृपया बाद में पुन: प्रयास करें

# apiErrorDescription
source: Oops! Something went wrong. Please try again later.
hi: उफ़! कुछ गलत हो गया। कृपया बाद में पुन: प्रयास करें।

# theme
source: Theme Demo
hi: थीम डेमो

source: Connection Timeout
hi: रिश्तों का समय बाहर

# connectionTimeoutDesc
source: Oops! It seems the connection timed out. Please check your internet connection and try again.
hi: उफ़! ऐसा लगता है कि कनेक्शन का समय समाप्त हो गया है। अपने इंटरनेट कनेक्शन की जाँच करें और पुन: प्रयास करें।

# sendTimeout
source: Connection Timeout
hi: रिश्तों का समय बाहर

# sendTimeoutDesc
source: Oops! It seems the connection timed out. Please check your internet connection and try again.
hi: उफ़! ऐसा लगता है कि कनेक्शन का समय समाप्त हो गया है। अपने इंटरनेट कनेक्शन की जाँच करें और पुन: प्रयास करें।

# receiveTimeout
source: Data Reception Issue
hi: डेटा रिसेप्शन समस्या

# receiveTimeoutDesc
source: Oops! We're having trouble receiving data right now. Please try again later.
hi: उफ़! हमें अभी डेटा प्राप्त करने में समस्या हो रही है। कृपया बाद में पुन: प्रयास करें।

# badCertificate
source: Security Certificate Problem
hi: सुरक्षा प्रमाणपत्र समस्या

# badCertificateDesc
source: Sorry, there's a problem with the security certificate. Please contact support for assistance.
hi: क्षमा करें, सुरक्षा प्रमाणपत्र में कोई समस्या है। कृपया सहायता के लिए समर्थन से संपर्क करें।

# badResponse
source: Unexpected Server Response
hi: अप्रत्याशित सर्वर प्रतिक्रिया

# badResponseDesc
source: Oh no! We received an unexpected response from the server. Please try again later.
hi: अरे नहीं! हमें सर्वर से एक अप्रत्याशित प्रतिक्रिया प्राप्त हुई. कृपया बाद में पुन: प्रयास करें।

# connectionError
source: Connection Issue
hi: कनेक्शन समस्या

# connectionErrorDesc
source: We're having trouble connecting to the server. Please check your internet connection and try again.
hi: हमें सर्वर से कनेक्ट होने में समस्या आ रही है. अपने इंटरनेट कनेक्शन की जाँच करें और पुन: प्रयास करें।

# unknown
source: Unknown Error
hi: अज्ञात त्रुटि

# unknownDesc
source: Oops! Something went wrong. Please try again later.
hi: उफ़! कुछ गलत हो गया। कृपया बाद में पुन: प्रयास करें।

# code200
source: The request was successful.
hi: अनुरोध सफल रहा.

# code201
source: A new resource was created successfully.
hi: एक नया संसाधन सफलतापूर्वक बनाया गया.

# code202
source: The request was accepted for processing, but the processing has not been completed.
hi: प्रसंस्करण के लिए अनुरोध स्वीकार कर लिया गया था, लेकिन प्रसंस्करण पूरा नहीं हुआ है।

# code301
source: The resource has been permanently moved to a new location.
hi: संसाधन को स्थायी रूप से एक नए स्थान पर स्थानांतरित कर दिया गया है।

# code302
source: The resource has been temporarily moved to a new location.
hi: संसाधन को अस्थायी रूप से एक नए स्थान पर स्थानांतरित कर दिया गया है।

# code304
source: The resource has not been modified since the last request.
hi: अंतिम अनुरोध के बाद से संसाधन को संशोधित नहीं किया गया है।

# code400
source: The server could not understand the request due to malformed syntax.
hi: सर्वर विकृत सिंटैक्स के कारण अनुरोध को समझ नहीं सका।

# code401
source: The request requires user authentication.
hi: अनुरोध के लिए उपयोगकर्ता प्रमाणीकरण की आवश्यकता है।

# code403
source: The server understood the request, but refuses to fulfill it.
hi: सर्वर ने अनुरोध को समझ लिया, लेकिन उसे पूरा करने से इंकार कर दिया।

# code404
source: The requested resource could not be found.
hi: अनुरोधित संसाधन नहीं मिल सका.

# code405
source: The method specified in the request is not allowed for the requested resource.
hi: अनुरोधित संसाधन के लिए अनुरोध में निर्दिष्ट विधि की अनुमति नहीं है।

# code409
source: The request could not be completed due to a conflict with the current state of the resource.
hi: संसाधन की वर्तमान स्थिति के साथ टकराव के कारण अनुरोध पूरा नहीं किया जा सका।

# code500
source: The server encountered an unexpected condition which prevented it from fulfilling the request.
hi: सर्वर को एक अप्रत्याशित स्थिति का सामना करना पड़ा जिसने उसे अनुरोध पूरा करने से रोक दिया।

# code503
source: The server is currently unable to handle the request.
hi: सर्वर फिलहाल अनुरोध को संभालने में असमर्थ है।

# welcome
source: Welcome {name}
hi: स्वागत है {name}
